Config/Documents/ВнутреннийЭлектронныйДокумент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВнутреннийЭлектронныйДокумент</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеВнутреннегоЭлектронногоДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКомандыПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойФайл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнутреннийЭлектронныйДокументПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойФайлPDF</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнутреннийЭлектронныйДокументПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеФормуляраФайлPDF</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнутреннийЭлектронныйДокументПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеСоздаватьФормулярPDF</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/СостоянияСформированныхФормуляровВнутреннихЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияСформированныхФормуляровВнутреннихЭД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подписано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФайлВнутреннегоЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнутреннийЭлектронныйДокументПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Catalogs/ВнутреннийЭлектронныйДокументПрисоединенныеФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВнутреннийЭлектронныйДокументПрисоединенныеФайлы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиСинхронизацииФайлов</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецФайла</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЭлектронныйДокумент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаМодификацииУниверсальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зашифрован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиСинхронизацииФайлов</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексКартинки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанЭП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактирует</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиСинхронизацииФайлов</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусИзвлеченияТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИзвлеченияТекстаФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипХраненияФайла</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыХраненияФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Том</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТомаХраненияФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьВерсии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Comment>Признак того, что файл является служебным</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Documents/ВнутреннийЭлектронныйДокумент/Forms/ПодписаниеФормуляровPDF/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КоличествоДокументовНаПодпись = 1000;
	
	УстановитьВидимостьЭлементовОрганизации(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = ИмяСобытияОбновленияПредставленияФормуляра() Тогда
		ЗаполнитьДокументыНаПодписьНаСервере();
		УстановитьВидимостьЭлементов(ЭтотОбъект, Истина);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПоВсемОрганизациямПриИзменении(Элемент)

	УстановитьВидимостьЭлементовОрганизации(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормы_ДокументыНаПодпись

&НаКлиенте
Процедура ДокументыНаПодписьВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ДокументыНаПодписьОсновнойФайлPDF" Тогда
		ОткрытьЭД(ВыбраннаяСтрока);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьДокументыНаПодпись(Команда)
	
	Если РежимПодписания = 1 И НЕ ЗначениеЗаполнено(Организация) Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Не указана организация. Следует заполнить поле ""Организация"" и повторить действие!'"));
		
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДокументыНаПодписьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьДокументы(Команда)
	УстановитьВидимостьЭлементов(ЭтотОбъект, Ложь);
	ПодписатьПредставленияФормуляровНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДокументыНаПодписьНаСервере()
	
	Если РежимПодписания = 0 Тогда
		ОрганизацияОтбора = Справочники.Организации.ПустаяСсылка();
	Иначе
		ОрганизацияОтбора = Организация;
	КонецЕсли;	
	
	ДокументыНаПодпись.Очистить();
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1000
	               |	ВнутреннийЭлектронныйДокументПрисоединенныеФайлы.Ссылка КАК ОсновнойФайлPDF,
	               |	ВнутреннийЭлектронныйДокументПрисоединенныеФайлы.ВладелецФайла КАК ДокументУчета
	               |ИЗ
	               |	Справочник.ВнутреннийЭлектронныйДокументПрисоединенныеФайлы КАК ВнутреннийЭлектронныйДокументПрисоединенныеФайлы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияСформированныхФормуляровВнутреннихЭД КАК СостоянияСформированныхФормуляровВнутреннихЭД
	               |		ПО (СостоянияСформированныхФормуляровВнутреннихЭД.ФайлВнутреннегоЭД = ВнутреннийЭлектронныйДокументПрисоединенныеФайлы.Ссылка)
	               |ГДЕ
	               |	ВнутреннийЭлектронныйДокументПрисоединенныеФайлы.Служебный = ЛОЖЬ
	               |	И ВнутреннийЭлектронныйДокументПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ
	               |	И СостоянияСформированныхФормуляровВнутреннихЭД.Подписано ЕСТЬ NULL
	               |	И ВЫРАЗИТЬ(ВнутреннийЭлектронныйДокументПрисоединенныеФайлы.ВладелецФайла КАК Документ.ВнутреннийЭлектронныйДокумент).Организация = &Организация";
	Если КоличествоДокументовНаПодпись > 0 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "1000", Формат(КоличествоДокументовНаПодпись,"ЧГ="));
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПЕРВЫЕ 1000", "");
	КонецЕсли;
	Если ЗначениеЗаполнено(ОрганизацияОтбора) Тогда
		Запрос.УстановитьПараметр("Организация", ОрганизацияОтбора);
	Иначе	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И ВЫРАЗИТЬ(ВнутреннийЭлектронныйДокументПрисоединенныеФайлы.ВладелецФайла КАК Документ.ВнутреннийЭлектронныйДокумент).Организация = &Организация", "");
	КонецЕсли;	
	
	Запрос.Текст = ТекстЗапроса;

	ДанныеФормуляров = Запрос.Выполнить().Выгрузить();
	ДокументыНаПодпись.Загрузить(ДанныеФормуляров);
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеПодписанДляФайлаФормуляра(ФайлВнутреннегоЭД)

	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.СостоянияСформированныхФормуляровВнутреннихЭД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ФайлВнутреннегоЭД.Установить(ФайлВнутреннегоЭД);
	
	Запись = НаборЗаписей.Добавить();
	Запись.ФайлВнутреннегоЭД = ФайлВнутреннегоЭД;
	Запись.Подписано = Истина;
	
	НаборЗаписей.Записать();

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма, РазрешитьПодписание)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"КоличествоДокументовНаПодпись", "Доступность", РазрешитьПодписание);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ЗаполнитьДокументыНаПодпись", "Доступность", РазрешитьПодписание);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ПодписатьДокументы", "Доступность", РазрешитьПодписание);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"РежимПодписания", "Доступность", РазрешитьПодписание);
	
	Если Форма.РежимПодписания = 1  Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"Организация", "Доступность", РазрешитьПодписание);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовОрганизации(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"Организация", "Видимость", Форма.РежимПодписания = 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьПредставленияФормуляровНаКлиенте()
	НаборДанных = ДанныеПредставленияФормуляров(УникальныйИдентификатор);

	Для Каждого Данные Из НаборДанных Цикл
		Представление = СтрШаблон("%1 (%2)", Данные.Заголовок, Данные.ФорматПервичногоДокумента);
			
		Данные.Вставить("Представление", Новый Структура("Значение, Представление", , Представление));
	КонецЦикла;
	
	Если НаборДанных.Количество() > 1 Тогда
		Операция = НСтр("ru = 'Подпись документов'");
		ЗаголовокДанных = НСтр("ru = 'Документы'");
		ПредставлениеНабора = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Документы (%1)'"), НаборДанных.Количество());
	Иначе
		Операция = НСтр("ru = 'Подпись документа'");
		ЗаголовокДанных = НСтр("ru = 'Документ'");
		ПредставлениеНабора = НаборДанных[0].Заголовок;
	КонецЕсли;

	ОписаниеДанных = Новый Структура;
	ОписаниеДанных.Вставить("Операция", Операция);
	ОписаниеДанных.Вставить("ЗаголовокДанных", ЗаголовокДанных);
	ОписаниеДанных.Вставить("СообщитьОЗавершении", Ложь);
	ОписаниеДанных.Вставить("ПоказатьКомментарий", Ложь);
	
	ОписаниеДанных.Вставить("НаборДанных", НаборДанных);
	ОписаниеДанных.Вставить("ПредставлениеНабора", ПредставлениеНабора);

	Обработчик = Новый ОписаниеОповещения("ПродолжитьПослеЭлектроннойПодписи", ЭтотОбъект);
	ПараметрыПодписания = ЭлектроннаяПодписьКлиент.НовыйТипПодписи();
	ПараметрыПодписания.ВыборДоверенности = Истина;
	ЭлектроннаяПодписьКлиент.Подписать(ОписаниеДанных, , Обработчик, ПараметрыПодписания)
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьПослеЭлектроннойПодписи(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Успех Тогда
		
		Для Каждого ТекДанные Из Результат.НаборДанных Цикл
			ТекДанные.Удалить("АдресТабличногоДокумента");
			ТекДанные.Удалить("Данные");
			ТекДанные.Удалить("Заголовок");
			ТекДанные.Удалить("Представление");

			Если Результат.Свойство("РезультатПроверкиМЧДДляПодписания") Тогда
				Если Результат.РезультатПроверкиМЧДДляПодписания <> Неопределено Тогда
					РезультатПроверкиПодписиПоМЧД = Новый Структура;
					РезультатПроверкиПодписиПоМЧД.Вставить("ТребуетсяПроверка", Истина);
					
					ТекДанные.СвойстваПодписи.Вставить("РезультатПроверкиПодписиПоМЧД", РезультатПроверкиПодписиПоМЧД);
					Если Результат.Свойство("ВыбраннаяДоверенность") Тогда
						ТекДанные.СвойстваПодписи.РезультатПроверкиПодписиПоМЧД.Вставить("МашиночитаемаяДоверенность", Результат.ВыбраннаяДоверенность);
					КонецЕсли;
					ПротоколПроверки = Новый Соответствие;
					ПроверкаДоверенности = Новый Структура;
					ПроверкаПодписанта = Новый Структура;
					ПроверкаПолномочий = Новый Структура;
					ПроверкаДокумента = Новый Структура;
					
					Проверка = Новый Структура;
					Проверка.Вставить("Верна", Неопределено);
					Проверка.Вставить("ЗаголовокПроверки", "");
					Проверка.Вставить("ТекстПроверки", "");
					Проверка.Вставить("ДатаПроверки", Неопределено);
					Проверка.Вставить("РучнаяПроверка", Ложь);
					Проверка.Вставить("ДополнительныеДанные", Неопределено);
					
					Если Результат.РезультатПроверкиМЧДДляПодписания.Свойство("ПроверкаДоверенности") Тогда
						ПроверкаДоверенности = Результат.РезультатПроверкиМЧДДляПодписания.ПроверкаДоверенности;
					КонецЕсли;	
					Если Результат.РезультатПроверкиМЧДДляПодписания.Свойство("ПроверкаПодписанта") Тогда
						ПроверкаПодписанта = Результат.РезультатПроверкиМЧДДляПодписания.ПроверкаПодписанта;
					КонецЕсли;
						
					ПроверкаПолномочий = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(Проверка);
					ПроверкаПолномочий.ЗаголовокПроверки = "Проверка полномочий";
					ПроверкаДокумента = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(Проверка);
					ПроверкаДокумента.ЗаголовокПроверки = "Проверка документа";
					
					ПротоколПроверки.Вставить("ПроверкаДоверенности", ПроверкаДоверенности);
					ПротоколПроверки.Вставить("ПроверкаПодписанта", ПроверкаПодписанта);
					ПротоколПроверки.Вставить("ПроверкаПолномочий", ПроверкаПолномочий);
					ПротоколПроверки.Вставить("ПроверкаДокумента", ПроверкаДокумента);
					
					ТекДанные.СвойстваПодписи.РезультатПроверкиПодписиПоМЧД.Вставить("ПротоколПроверки", ПротоколПроверки);
				КонецЕсли;
			КонецЕсли;			
		КонецЦикла;
		
		ПодписатьЭлектроннойПодписью(Результат.НаборДанных);
	Иначе
		УстановитьВидимостьЭлементов(ЭтотОбъект, Истина);
		Возврат;
	КонецЕсли;

	Оповестить(ИмяСобытияОбновленияПредставленияФормуляра());
	
КонецПроцедуры

&НаСервере
Процедура ПодписатьЭлектроннойПодписью(ОписаниеДанных) Экспорт
	
	Для Каждого Данные Из ОписаниеДанных Цикл
		
		ПодписатьЭлектронныйДокумент(Данные);
		
	КонецЦикла;

	УстановитьВидимостьЭлементов(ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПодписатьЭлектронныйДокумент(Параметры) Экспорт
	
	УчетныйДокумент = Параметры.УчетныйДокумент;
	ФайлДляПодписи = Параметры.ФайлДляПодписи;
	
	Если ТипЗнч(Параметры.СвойстваПодписи) = Тип("Строка") Тогда
		СвойстваПодписи = ПолучитьИзВременногоХранилища(Параметры.СвойстваПодписи);
	Иначе
		СвойстваПодписи = Параметры.СвойстваПодписи;
	КонецЕсли;
	
	Подписант = СвойстваПодписи.УстановившийПодпись;
	ДатаИзменения = СвойстваПодписи.ДатаПодписи;
	
	НачатьТранзакцию();
	Попытка
		
		ДобавитьЭлектроннуюПодпись(ФайлДляПодписи, СвойстваПодписи);
		
		УстановитьСостояниеПодписанДляФайлаФормуляра(ФайлДляПодписи);

		ЗафиксироватьТранзакцию()
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлектроннуюПодпись(ФайлДляПодписи, СвойстваПодписи)
	
	ЭлектроннаяПодпись.ДобавитьПодпись(ФайлДляПодписи, СвойстваПодписи);
	
КонецПроцедуры

&НаСервере
Функция ДанныеПредставленияФормуляров(УИДФормы)
	НаборДанныхДляПодписи = Новый Массив;

	Для Каждого ДанныеДляПодписи Из ДокументыНаПодпись Цикл
		ДанныеДокумента = Новый Структура;
		ТекЗаголовок = СокрЛП(ДанныеДляПодписи.ОсновнойФайлPDF);
		ДанныеДокумента.Вставить("Заголовок", ТекЗаголовок);
		ДанныеДокумента.Вставить("АдресТабличногоДокумента", "");
		ДанныеДокумента.Вставить("УчетныйДокумент", ДанныеДляПодписи.ДокументУчета);
		ДанныеДокумента.Вставить("ФайлДляПодписи", ДанныеДляПодписи.ОсновнойФайлPDF);
		ДанныеДокумента.Вставить("ФорматПервичногоДокумента", "PDF");
		
		ПараметрыДанныхФайла = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
		ПараметрыДанныхФайла.ПолучатьСсылкуНаДвоичныеДанные = Истина;
		ПараметрыДанныхФайла.ИдентификаторФормы = УИДФормы;

		ДанныеФайла = РаботаСФайлами.ДанныеФайла(ДанныеДляПодписи.ОсновнойФайлPDF, ПараметрыДанныхФайла);
		ДанныеДокумента.Вставить("Данные", ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
		
		НаборДанныхДляПодписи.Добавить(ДанныеДокумента);
	
	КонецЦикла;

	Возврат НаборДанныхДляПодписи;
КонецФункции	

&НаКлиенте
Функция ИмяСобытияОбновленияПредставленияФормуляра() Экспорт
	Возврат "ОбновитьСостояниеПредставленияФормуляра";
КонецФункции

&НаКлиенте
Процедура ОткрытьЭД(ВыбранноеЗначение)
	ДанныеСтроки = ДокументыНаПодпись.НайтиПоИдентификатору(ВыбранноеЗначение);
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСтроки.ОсновнойФайлPDF) Тогда
		
		ВнутреннийЭДОКлиентПереопределяемый.ОткрытьФайлPDF(ДанныеСтроки.ОсновнойФайлPDF, УникальныйИдентификатор, Ложь);	
		
	КонецЕсли;
КонецПроцедуры


#КонецОбласти
